[
  {
    "id": "sojubottle0",
    "character-dna": "[Fixed] Character DNA & Style Definition (color tuned to yellow‑green)\nA small, friendly cyber‑security detective mascot named \"Alyac\". Alyac is a chibi, capsule‑shaped character approximately 20 cm tall, designed in a clean 3D toy style.\n\n- Physical form: a perfectly smooth capsule divided at the midline; the lower half is a continuous white legless capsule base; arms are short with rounded hands.\n- Face: two small vertically oval black eyes and a small centered curved mouth; no nose; minimal centered features.\n- Materials and finish: soft matte plastic with low‑intensity highlights and gentle bevels.\n- Clothing: none.\n- Signature accessory: a bright yellow magnifying glass with a circular clear lens and a short cylindrical handle, always in Alyac’s right hand (viewer‑left).\n- Color palette: pastel yellow‑green for the head and arms and pure white for the body, with bright yellow for the magnifying glass and black accents for eyes and mouth only. The yellow‑green hue is warm and slightly yellow‑leaning rather than blue‑leaning. Exact target color reference for the head/arms: HEX #AEE574 (approx. HSL 92°, 62%, 69%). Use this exact yellow‑green consistently across all scenes.\n- Aesthetic and lighting: cheerful, approachable, vigilant; modern minimal product‑shot look with soft diffused studio lighting on clean pastel backgrounds.\n\nKey anchors to reuse verbatim across prompts: \"pastel yellow‑green dome (#AEE574)\", \"white legless capsule base\", \"soft matte plastic\", \"two small vertically oval black eyes\", \"small centered curved mouth\", \"bright yellow magnifying glass held in the right hand (viewer‑left)\".",
    "image": "data/anchors/sojubottle0.jpeg"
  },
  {
    "id": "blackgirl0",
    "character-dna": "Core Identity\nAn 22-year-old Black woman named \"Amani,\" a first-year fashion design student and rookie model. Calm, observant, quietly confident; poised in front of a camera yet naturally warm.\n\nPhysical Traits\nOval face with symmetrical features and high cheekbones; straight nose with a soft tip; full, heart-shaped lips in matte dark cocoa. Deep, cool-toned ebony skin with a smooth, even, freckle-free complexion and a soft natural sheen. Large almond-shaped eyes, cool gray irises with a faint limbal ring, long upper lashes, soft smoky eyeliner. Brows are full, straight, and slightly arched in dark charcoal. Hair is platinum-white, center-parted, silky, and waist-length with gentle waves framing the shoulders. Age should clearly read as eighteen.\n\nSignature Outfit\nWears a minimalist white ribbed tank top with thin straps; clean, fitted, and contemporary. (For full-body frames, pair with high-waisted black jeans and simple white sneakers—keep the term tank top consistent.)\n\nKey Accessories\nAlways wears large polished silver hoop earrings and a slim silver chain necklace with a small horizontal bar pendant. These items are constant identifiers.\n\nStyling & Makeup Notes\nSoft natural base with subtle contour, muted warm blush, matte dark-cocoa lipstick, and understated highlight on cheekbones and cupid’s bow. Nails short and natural.\n\nConsistency Rules\nKeep: platinum-white center-parted long hair; deep cool-toned ebony even-toned skin (freckle-free); white tank top; silver hoop earrings; silver chain with bar pendant; cool gray almond eyes; matte dark-cocoa lips. Text-free, brand-free visuals; clean contemporary look.",
    "image": "data/anchors/blackgirl0.jpeg"
  }
]